taskleaf/app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "bb1111"], ["updated_at", "2018-12-08 18:34:18.372569"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.update!(task_params)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ccc"], ["description", "ddd"], ["created_at", "2018-12-08 18:48:17.994035"], ["updated_at", "2018-12-08 18:48:17.994035"]]
---
      task = Task.new(task_params)
      task.save!